In [ ]:
import pandas as pd
df = pd.read_csv('titanic_train.csv')
df.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [ ]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [ ]:
df.drop(['PassengerId', 'Name', 'SibSp','Parch', 'Ticket', 'Cabin', 'Embarked'], axis='columns', inplace=True)

In [ ]:
df.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [7]:
target = df.Survived
features = df.drop('Survived', axis='columns')

In [9]:
# ML models cannot handle text
dummies = pd.get_dummies(features.Sex)
dummies.head()

   female  male
0       0     1
1       1     0
2       1     0
3       1     0
4       0     1

In [10]:
features = pd.concat([features, dummies], axis='columns')

In [11]:
features.head()

   Pclass     Sex   Age     Fare  female  male
0       3    male  22.0   7.2500       0     1
1       1  female  38.0  71.2833       1     0
2       3  female  26.0   7.9250       1     0
3       1  female  35.0  53.1000       1     0
4       3    male  35.0   8.0500       0     1

In [12]:
features.drop('Sex', axis='columns', inplace=True)
features.head()

   Pclass   Age     Fare  female  male
0       3  22.0   7.2500       0     1
1       1  38.0  71.2833       1     0
2       3  26.0   7.9250       1     0
3       1  35.0  53.1000       1     0
4       3  35.0   8.0500       0     1

In [13]:
features.columns[features.isna().any()]

Index(['Age'], dtype='object')

In [14]:
features.Age[:10]

0    22.0
1    38.0
2    26.0
3    35.0
4    35.0
5     NaN
6    54.0
7     2.0
8    27.0
9    14.0
Name: Age, dtype: float64

In [15]:
features.Age = features.Age.fillna(features.Age.mean())

In [16]:
features.columns[features.isna().any()]

Index([], dtype='object')

In [23]:
from sklearn.model_selection import train_test_split
X_train, X_test, y_train, y_test = train_test_split(features, target, test_size=0.2)

In [24]:
len(X_train)

712

In [25]:
len(X_test)

179

In [26]:
len(features)

891

In [27]:
from sklearn.naive_bayes import GaussianNB
model = GaussianNB()
model.fit(X_train, y_train)

GaussianNB()

In [28]:
model.score(X_test, y_test)

0.8044692737430168

In [29]:
X_test[:10]

     Pclass        Age     Fare  female  male
625       1  61.000000  32.3208       0     1
770       3  24.000000   9.5000       0     1
279       3  35.000000  20.2500       1     0
864       2  24.000000  13.0000       0     1
367       3  29.699118   7.2292       1     0
508       3  28.000000  22.5250       0     1
839       1  29.699118  29.7000       0     1
885       3  39.000000  29.1250       1     0
189       3  36.000000   7.8958       0     1
510       3  29.000000   7.7500       0     1

In [30]:
y_test[:10]

625    0
770    0
279    1
864    0
367    1
508    0
839    1
885    0
189    0
510    1
Name: Survived, dtype: int64

In [31]:
model.predict(X_test[:10])

array([0, 0, 1, 0, 1, 0, 0, 1, 0, 0], dtype=int64)

In [32]:
from sklearn.naive_bayes import MultinomialNB
model = MultinomialNB()
model.fit(X_train, y_train)

MultinomialNB()

In [33]:
model.score(X_test, y_test)

0.7597765363128491

In [34]:
from sklearn.naive_bayes import BernoulliNB
model = BernoulliNB()
model.fit(X_train, y_train)

BernoulliNB()

In [35]:
model.score(X_test, y_test)

0.8100558659217877

In [1]:
print("rest")

rest